In [6]:
#Q1-
import pandas as pd

In [7]:
data =[4, 8, 15,16,23,42]

In [9]:
series= pd.Series(data)

In [11]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
#Q2

In [12]:
data =[1,2,3,4,5,6,7,8,9,10]

In [13]:
type(data)

list

In [14]:
series= pd.Series(data)

In [15]:
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [18]:
#Q3
data={ 'Name' : ['Alice' , 'Bob', 'Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female', 'Male', 'Female']}
dic = pd.DataFrame(data)
dic

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [33]:
#A DataFrame in pandas is a two-dimensional table with rows and columns, where each column can have a different data type. It can be seen as a collection of Pandas series objects that share the same index. In contrast, a pandas series is a one-dimensional array-like object that can hold any data type, and it has a labeled index.
#example of data type
data={ 'Name' : ['Alice' , 'Bob', 'Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female', 'Male', 'Female']}
dic = pd.DataFrame(data)
dic

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [36]:
#examplee of series
dic['Age']

0    25
1    30
2    27
Name: Age, dtype: int64

In [37]:
type(dic['Age'])

pandas.core.series.Series

In [45]:
#q5
#head() and tail(): to show the first or last rows of the DataFrame
#describe(): to show summary statistics of the DataFrame
#sort_values(): to sort the DataFrame by one or more columns
#groupby(): to group the DataFrame by one or more columns and perform aggregate operations
#dropna(): to remove rows with missing values
#fillna(): to fill missing values with a specified value or method'

data={ 'Name' : ['Alice' , 'Bob', 'Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female', 'Male', 'Female']}

In [49]:
dic = pd.DataFrame(data)
dic.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [ ]:
#Q6
#Both Series and DataFrame are mutable in nature, while Panel is considered to be deprecated and is no longer recommended for use in pandas. Instead, multi-dimensional data should be stored and manipulated in a multi-index DataFrame.

In [50]:
#Q7
s1 = pd.Series([10, 20, 30, 40, 50], name='A')
s2 = pd.Series([1, 2, 3, 4, 5], name='B')
df = pd.DataFrame({'A': s1, 'B': s2})
df

    A  B
0  10  1
1  20  2
2  30  3
3  40  4
4  50  5